-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Дек 05 2021 г., 13:24
-- Версия сервера: 10.3.16-MariaDB
-- Версия PHP: 7.3.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `datasub`
--

-- --------------------------------------------------------

--
-- Структура таблицы `exams`
--

CREATE TABLE `exams` (
  `id` int(11) NOT NULL,
  `StudentId` int(11) NOT NULL,
  `ExamName` varchar(255) NOT NULL,
  `Result` tinyint(3) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `exams`
--

INSERT INTO `exams` (`id`, `StudentId`, `ExamName`, `Result`) VALUES
(1, 6, 'Математика', 5),
(2, 10, 'Математика', 2),
(3, 11, 'Математика', 3),
(4, 12, 'Математика', 4),
(5, 13, 'Математика', 1),
(6, 5, 'Математика', 5),
(7, 4, 'Математика', 4),
(8, 3, 'Математика', 3),
(9, 1, 'Математика', 2),
(10, 9, 'Математика', 5),
(11, 7, 'Математика', 1),
(12, 8, 'Математика', 4),
(13, 6, 'физика', 4),
(14, 10, 'физика', 5),
(15, 11, 'физика', 2),
(16, 12, 'физика', 4),
(17, 13, 'физика', 2),
(18, 5, 'физика', 1),
(19, 4, 'физика', 3),
(20, 3, 'физика', 3),
(21, 1, 'физика', 5),
(22, 9, 'физика', 5),
(23, 7, 'физика', 3),
(24, 8, 'физика', 5),
(25, 6, 'Химия', 4),
(26, 10, 'Химия', 2),
(27, 11, 'Химия', 2),
(28, 12, 'Химия', 5),
(29, 5, 'Химия', 1),
(30, 4, 'Химия', 3),
(31, 3, 'Химия', 5),
(32, 4, 'Химия', 5),
(33, 1, 'Химия', 3),
(34, 1, 'Химия', 3),
(35, 7, 'Химия', 2),
(36, 8, 'Химия', 2),
(37, 15, 'Математика', 2),
(38, 16, 'Математика', 2),
(39, 17, 'Математика', 2),
(40, 18, 'Математика', 2),
(41, 19, 'Математика', 2),
(42, 20, 'Математика', 2),
(43, 21, 'Математика', 2),
(44, 22, 'Математика', 2),
(45, 23, 'Математика', 2),
(46, 24, 'Математика', 2),
(47, 25, 'Математика', 2),
(48, 15, 'физика', 2),
(49, 16, 'физика', 2),
(50, 17, 'физика', 2),
(51, 18, 'физика', 2),
(52, 19, 'физика', 2),
(53, 20, 'физика', 2),
(54, 21, 'физика', 2),
(55, 22, 'физика', 2),
(56, 23, 'физика', 2),
(57, 24, 'физика', 2),
(58, 25, 'физика', 2),
(59, 6, 'Труды', 2),
(60, 7, 'Труды', 2),
(61, 8, 'Труды', 2),
(62, 9, 'Труды', 2),
(63, 6, 'Литература', 2),
(64, 7, 'Литература', 2),
(65, 8, 'Литература', 2),
(66, 9, 'Литература', 2),
(67, 26, 'Математика', 2),
(68, 27, 'Математика', 2),
(69, 28, 'Математика', 2),
(70, 29, 'Математика', 2),
(71, 30, 'Математика', 2),
(72, 31, 'Математика', 2),
(73, 26, 'Химия', 2),
(74, 27, 'Химия', 2),
(75, 28, 'Химия', 2),
(76, 29, 'Химия', 2),
(77, 30, 'Химия', 2),
(78, 31, 'Химия', 2);

-- --------------------------------------------------------

--
-- Структура таблицы `students`
--

CREATE TABLE `students` (
  `StudentId` int(11) NOT NULL,
  `FirstName` varchar(255) NOT NULL,
  `LastName` varchar(255) NOT NULL,
  `_Group` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `students`
--

INSERT INTO `students` (`StudentId`, `FirstName`, `LastName`, `_Group`) VALUES
(1, 'Иван', 'Иван', '01'),
(3, 'Петр', 'Петр', '01'),
(4, 'Олег', 'Олег', '01'),
(5, 'Миша', 'Миша', '01'),
(6, 'test', 'test', '02'),
(7, 'гриша', 'test', '02'),
(8, 'федя', 'test', '02'),
(9, 'иван', 'test', '02'),
(10, 'test', 'Александр', '03'),
(11, 'test', 'Евгений', '03'),
(12, 'test', 'Ахмед', '03'),
(13, 'test', 'Миша', '03'),
(15, 'Олег', 'Зубченко', '01'),
(16, 'Иван', 'Зубченко', '01'),
(17, 'Дмитрий', 'Зубченко', '01'),
(18, 'Федор', 'Зубченко', '01'),
(19, 'Игорь', 'Зубченко', '01'),
(20, 'Василий', 'Зубченко', '01'),
(21, 'Константин', 'Зубченко', '01'),
(22, 'Сергей', 'Зубченко', '01'),
(23, 'Роман', 'Зубченко', '01'),
(24, 'Никита', 'Зубченко', '01'),
(25, 'Ярослав', 'Зубченко', '01'),
(26, '1', '1', '02'),
(27, '2', '2', '02'),
(28, '3', '3', '02'),
(29, '4', '4', '02'),
(30, '5', '5', '02'),
(31, '6', '6', '02');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `exams`
--
ALTER TABLE `exams`
  ADD PRIMARY KEY (`id`),
  ADD KEY `StudentId` (`StudentId`);

--
-- Индексы таблицы `students`
--
ALTER TABLE `students`
  ADD PRIMARY KEY (`StudentId`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `exams`
--
ALTER TABLE `exams`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=79;

--
-- AUTO_INCREMENT для таблицы `students`
--
ALTER TABLE `students`
  MODIFY `StudentId` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=32;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `exams`
--
ALTER TABLE `exams`
  ADD CONSTRAINT `exams_ibfk_1` FOREIGN KEY (`StudentId`) REFERENCES `students` (`StudentId`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
